In [1]:
# movielens의 영화평점 데이터

In [2]:
#이 데이터는 영화 평점과 영화에 대한 정보 그리고 사용자에 대한 정보가 포함되어 있다. 이런종류의 데이터는 추천시스템을 개발하는데 
#주로 이용되어진다.6000명의 사용자로부터 수집한 4000여편의 영화에 대한 백만개의 영화평점을 담고있음
#이 데이터셋은 평점,사용자정보, 영화정보의 3가지 테이블로 나누어져 있음

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.options.display.max_rows = 10

In [21]:
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
users = pd.read_table('users.dat.txt', sep = '::',
                     header = None, names = unames)

In [14]:
os.path.dirname(__C:/Users/KO/jupylab__)

SyntaxError: invalid syntax (Temp/ipykernel_2784/4222164271.py, line 1)

In [9]:
import os

In [16]:
os.getcwd()

'C:\\Users\\KO\\jupylab'

In [17]:
os.chdir('C:/Users/KO/jupylab')

In [23]:
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('ratings.dat.txt', sep = '::',
                       header = None, names = rnames)

In [24]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('movies.dat.txt', sep = '::',
                      header = None, names = mnames)

In [25]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

movies[:5]

In [26]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy


#### 나이와 성별에 따른 어떤 영화의 평균 평점을 계산해보자

merge함수를 이용해서 users데이터와 ratings 데이터를 먼저 병합후 나머지와 병합

In [30]:
data = pd.merge(pd.merge(users, ratings), movies)

In [31]:
data

,user_id,gender,age,occupation,zip,movie_id,rating,timestamp,title,genres
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...
1000204,5949,M,18,17,47901,2198,5,958846401,Modulations (1998),Documentary
1000205,5675,M,35,14,30030,2703,3,976029116,Broken Vessels (1998),Drama
1000206,5780,M,18,17,92886,2845,1,958153068,White Boys (1999),Drama
1000207,5851,F,18,20,55410,3607,5,957756608,One Little Indian (1973),Comedy|Drama|Western
1000208,5938,M,25,1,35401,2909,4,957273353,"Five Wives, Three Secretaries and Me (1998)",Documentary

In [32]:
data.iloc[0]

user_id                                            1
gender                                             F
age                                                1
occupation                                        10
zip                                            48067
movie_id                                        1193
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
genres                                         Drama
Name: 0, dtype: object

In [33]:
mean_ratings = data.pivot_table('rating', index = 'title',
                               columns = 'gender', aggfunc = 'mean')

In [34]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [35]:
ratings_by_title = data.groupby('title').size()

In [36]:
ratings_by_title[:10]

title
$1,000,000 Duck (1971)                37
'Night Mother (1986)                  70
'Til There Was You (1997)             52
'burbs, The (1989)                   303
...And Justice for All (1979)        199
1-900 (1994)                           2
10 Things I Hate About You (1999)    700
101 Dalmatians (1961)                565
101 Dalmatians (1996)                364
12 Angry Men (1957)                  616
dtype: int64

In [41]:
active_titles = ratings_by_title.index[ratings_by_title >= 250]

In [42]:
active_titles

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)', '12 Angry Men (1957)',
       '13th Warrior, The (1999)', '2 Days in the Valley (1996)',
       '20,000 Leagues Under the Sea (1954)', '2001: A Space Odyssey (1968)',
       '2010 (1984)',
       ...
       'X-Men (2000)', 'Year of Living Dangerously (1982)',
       'Yellow Submarine (1968)', 'You've Got Mail (1998)',
       'Young Frankenstein (1974)', 'Young Guns (1988)',
       'Young Guns II (1990)', 'Young Sherlock Holmes (1985)',
       'Zero Effect (1998)', 'eXistenZ (1999)'],
      dtype='object', name='title', length=1216)

In [44]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [46]:
mean_ratings = mean_ratings.loc[active_titles]

In [47]:
mean_ratings[:5]

gender                                    F         M
title
'burbs, The (1989)                 2.793478  2.962085
10 Things I Hate About You (1999)  3.646552  3.311966
101 Dalmatians (1961)              3.791444  3.500000
101 Dalmatians (1996)              3.240000  2.911215
12 Angry Men (1957)                4.184397  4.328421

# 여성에게 높은 평점을 받은 영화의 목록 구하기

In [48]:
top_female_ratings = mean_ratings.sort_values(by = 'F', ascending = False)

In [52]:
top_female_ratings[:10].index

Index(['Close Shave, A (1995)', 'Wrong Trousers, The (1993)',
       'Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)',
       'Wallace & Gromit: The Best of Aardman Animation (1996)',
       'Schindler's List (1993)', 'Shawshank Redemption, The (1994)',
       'Grand Day Out, A (1992)', 'To Kill a Mockingbird (1962)',
       'Creature Comforts (1990)', 'Usual Suspects, The (1995)'],
      dtype='object', name='title')

# 남녀간의 호불호가 갈리는 영화 찾기

In [53]:
mean_ratings['diff'] = mean_ratings['M'] - mean_ratings['F']

In [54]:
sorted_by_diff = mean_ratings.sort_values(by = 'diff')

In [55]:
sorted_by_diff[:10]

gender                                        F         M      diff
title
Dirty Dancing (1987)                   3.790378  2.959596 -0.830782
Jumpin' Jack Flash (1986)              3.254717  2.578358 -0.676359
Grease (1978)                          3.975265  3.367041 -0.608224
Little Women (1994)                    3.870588  3.321739 -0.548849
Steel Magnolias (1989)                 3.901734  3.365957 -0.535777
Anastasia (1997)                       3.800000  3.281609 -0.518391
Rocky Horror Picture Show, The (1975)  3.673016  3.160131 -0.512885
Color Purple, The (1985)               4.158192  3.659341 -0.498851
Age of Innocence, The (1993)           3.827068  3.339506 -0.487561
Free Willy (1993)                      2.921348  2.438776 -0.482573

여성들이 선호하는 영화순서대로 나타냄^

# 성별에 관계없이 호불호가 극명하게 나뉘는 영화를 찾아보자

영화별 평점 표준편차

In [60]:
rating_std_by_title = data.groupby('title')['rating'].std()

In [61]:
rating_std_by_title = rating_std_by_title.loc[active_titles]

평점 내림차순으로 시리즈 정렬

In [63]:
rating_std_by_title.sort_values(ascending = False)[:10]

title
Dumb & Dumber (1994)                     1.321333
Blair Witch Project, The (1999)          1.316368
Natural Born Killers (1994)              1.307198
Tank Girl (1995)                         1.277695
Rocky Horror Picture Show, The (1975)    1.260177
Eyes Wide Shut (1999)                    1.259624
Evita (1996)                             1.253631
Billy Madison (1995)                     1.249970
Fear and Loathing in Las Vegas (1998)    1.246408
Bicentennial Man (1999)                  1.245533
Name: rating, dtype: float64